MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB410/mcu.h
#define TRISD TRISD
extern volatile uint16_t TRISD __attribute__((__sfr__));
typedef struct tagTRISDBITS {
  uint16_t TRISD0:1;
  uint16_t TRISD1:1;
  uint16_t TRISD2:1;
  uint16_t TRISD3:1;
  uint16_t TRISD4:1;
  uint16_t TRISD5:1;
  uint16_t TRISD6:1;
  uint16_t TRISD7:1;
  uint16_t TRISD8:1;
  uint16_t TRISD9:1;
  uint16_t TRISD10:1;
  uint16_t TRISD11:1;
  uint16_t TRISD12:1;
  uint16_t TRISD13:1;
  uint16_t TRISD14:1;
  uint16_t TRISD15:1;
} TRISDBITS;
extern volatile TRISDBITS TRISDbits __attribute__((__sfr__));

#define PORTD PORTD
extern volatile uint16_t PORTD __attribute__((__sfr__));
typedef struct tagPORTDBITS {
  uint16_t RD0:1;
  uint16_t RD1:1;
  uint16_t RD2:1;
  uint16_t RD3:1;
  uint16_t RD4:1;
  uint16_t RD5:1;
  uint16_t RD6:1;
  uint16_t RD7:1;
  uint16_t RD8:1;
  uint16_t RD9:1;
  uint16_t RD10:1;
  uint16_t RD11:1;
  uint16_t RD12:1;
  uint16_t RD13:1;
  uint16_t RD14:1;
  uint16_t RD15:1;
} PORTDBITS;
extern volatile PORTDBITS PORTDbits __attribute__((__sfr__));

#define LATD LATD
extern volatile uint16_t LATD __attribute__((__sfr__));
typedef struct tagLATDBITS {
  uint16_t LATD0:1;
  uint16_t LATD1:1;
  uint16_t LATD2:1;
  uint16_t LATD3:1;
  uint16_t LATD4:1;
  uint16_t LATD5:1;
  uint16_t LATD6:1;
  uint16_t LATD7:1;
  uint16_t LATD8:1;
  uint16_t LATD9:1;
  uint16_t LATD10:1;
  uint16_t LATD11:1;
  uint16_t LATD12:1;
  uint16_t LATD13:1;
  uint16_t LATD14:1;
  uint16_t LATD15:1;
} LATDBITS;
extern volatile LATDBITS LATDbits __attribute__((__sfr__));

#define ODCD ODCD
extern volatile uint16_t ODCD __attribute__((__sfr__));
typedef struct tagODCDBITS {
  uint16_t ODCD0:1;
  uint16_t ODCD1:1;
  uint16_t ODCD2:1;
  uint16_t ODCD3:1;
  uint16_t ODCD4:1;
  uint16_t ODCD5:1;
  uint16_t ODCD6:1;
  uint16_t ODCD7:1;
  uint16_t ODCD8:1;
  uint16_t ODCD9:1;
  uint16_t ODCD10:1;
  uint16_t ODCD11:1;
  uint16_t ODCD12:1;
  uint16_t ODCD13:1;
  uint16_t ODCD14:1;
  uint16_t ODCD15:1;
} ODCDBITS;
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define ANSD ANSD
extern volatile uint16_t ANSD __attribute__((__sfr__));
__extension__ typedef struct tagANSDBITS {
  union {
    struct {
      uint16_t ANSD0:1;
      uint16_t ANSD1:1;
      uint16_t ANSD2:1;
      uint16_t ANSD3:1;
      uint16_t ANSD4:1;
      uint16_t ANSD5:1;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t ANSD8:1;
      uint16_t ANSD9:1;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
      uint16_t ANSD12:1;
      uint16_t ANSD13:1;
      uint16_t ANSD14:1;
      uint16_t ANSD15:1;
    };
    struct {
      uint16_t ANSELD0:1;
      uint16_t ANSELD1:1;
      uint16_t ANSELD2:1;
      uint16_t ANSELD3:1;
      uint16_t ANSELD4:1;
      uint16_t ANSELD5:1;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t ANSELD8:1;
      uint16_t ANSELD9:1;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
      uint16_t ANSELD12:1;
      uint16_t ANSELD13:1;
      uint16_t ANSELD14:1;
      uint16_t ANSELD15:1;
    };
  };
} ANSDBITS;
extern volatile ANSDBITS ANSDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t ANSELD __attribute__((__sfr__));
__extension__ typedef struct tagANSELDBITS {
  union {
    struct {
      uint16_t ANSD0:1;
      uint16_t ANSD1:1;
      uint16_t ANSD2:1;
      uint16_t ANSD3:1;
      uint16_t ANSD4:1;
      uint16_t ANSD5:1;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t ANSD8:1;
      uint16_t ANSD9:1;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
      uint16_t ANSD12:1;
      uint16_t ANSD13:1;
      uint16_t ANSD14:1;
      uint16_t ANSD15:1;
    };
    struct {
      uint16_t ANSELD0:1;
      uint16_t ANSELD1:1;
      uint16_t ANSELD2:1;
      uint16_t ANSELD3:1;
      uint16_t ANSELD4:1;
      uint16_t ANSELD5:1;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t ANSELD8:1;
      uint16_t ANSELD9:1;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
      uint16_t ANSELD12:1;
      uint16_t ANSELD13:1;
      uint16_t ANSELD14:1;
      uint16_t ANSELD15:1;
    };
  };
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define IOCPD IOCPD
extern volatile uint16_t IOCPD __attribute__((__sfr__));
typedef struct tagIOCPDBITS {
  uint16_t IOCPD0:1;
  uint16_t IOCPD1:1;
  uint16_t IOCPD2:1;
  uint16_t IOCPD3:1;
  uint16_t IOCPD4:1;
  uint16_t IOCPD5:1;
  uint16_t IOCPD6:1;
  uint16_t IOCPD7:1;
  uint16_t IOCPD8:1;
  uint16_t IOCPD9:1;
  uint16_t IOCPD10:1;
  uint16_t IOCPD11:1;
  uint16_t IOCPD12:1;
  uint16_t IOCPD13:1;
  uint16_t IOCPD14:1;
  uint16_t IOCPD15:1;
} IOCPDBITS;
extern volatile IOCPDBITS IOCPDbits __attribute__((__sfr__));

#define IOCND IOCND
extern volatile uint16_t IOCND __attribute__((__sfr__));
typedef struct tagIOCNDBITS {
  uint16_t IOCND0:1;
  uint16_t IOCND1:1;
  uint16_t IOCND2:1;
  uint16_t IOCND3:1;
  uint16_t IOCND4:1;
  uint16_t IOCND5:1;
  uint16_t IOCND6:1;
  uint16_t IOCND7:1;
  uint16_t IOCND8:1;
  uint16_t IOCND9:1;
  uint16_t IOCND10:1;
  uint16_t IOCND11:1;
  uint16_t IOCND12:1;
  uint16_t IOCND13:1;
  uint16_t IOCND14:1;
  uint16_t IOCND15:1;
} IOCNDBITS;
extern volatile IOCNDBITS IOCNDbits __attribute__((__sfr__));

#define IOCFD IOCFD
extern volatile uint16_t IOCFD __attribute__((__sfr__));
typedef struct tagIOCFDBITS {
  uint16_t IOCFD0:1;
  uint16_t IOCFD1:1;
  uint16_t IOCFD2:1;
  uint16_t IOCFD3:1;
  uint16_t IOCFD4:1;
  uint16_t IOCFD5:1;
  uint16_t IOCFD6:1;
  uint16_t IOCFD7:1;
  uint16_t IOCFD8:1;
  uint16_t IOCFD9:1;
  uint16_t IOCFD10:1;
  uint16_t IOCFD11:1;
  uint16_t IOCFD12:1;
  uint16_t IOCFD13:1;
  uint16_t IOCFD14:1;
  uint16_t IOCFD15:1;
} IOCFDBITS;
extern volatile IOCFDBITS IOCFDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile uint16_t CNPUD __attribute__((__sfr__));
__extension__ typedef struct tagCNPUDBITS {
  union {
    struct {
      uint16_t IOCPD0:1;
      uint16_t IOCPD1:1;
      uint16_t IOCPD2:1;
      uint16_t IOCPD3:1;
      uint16_t IOCPD4:1;
      uint16_t IOCPD5:1;
      uint16_t IOCPD6:1;
      uint16_t IOCPD7:1;
      uint16_t IOCPD8:1;
      uint16_t IOCPD9:1;
      uint16_t IOCPD10:1;
      uint16_t IOCPD11:1;
      uint16_t IOCPD12:1;
      uint16_t IOCPD13:1;
      uint16_t IOCPD14:1;
      uint16_t IOCPD15:1;
    };
    struct {
      uint16_t IOCPUD0:1;
      uint16_t IOCPUD1:1;
      uint16_t IOCPUD2:1;
      uint16_t IOCPUD3:1;
      uint16_t IOCPUD4:1;
      uint16_t IOCPUD5:1;
      uint16_t IOCPUD6:1;
      uint16_t IOCPUD7:1;
      uint16_t IOCPUD8:1;
      uint16_t IOCPUD9:1;
      uint16_t IOCPUD10:1;
      uint16_t IOCPUD11:1;
      uint16_t IOCPUD12:1;
      uint16_t IOCPUD13:1;
      uint16_t IOCPUD14:1;
      uint16_t IOCPUD15:1;
    };
    struct {
      uint16_t CNPUD0:1;
      uint16_t CNPUD1:1;
      uint16_t CNPUD2:1;
      uint16_t CNPUD3:1;
      uint16_t CNPUD4:1;
      uint16_t CNPUD5:1;
      uint16_t CNPUD6:1;
      uint16_t CNPUD7:1;
      uint16_t CNPUD8:1;
      uint16_t CNPUD9:1;
      uint16_t CNPUD10:1;
      uint16_t CNPUD11:1;
      uint16_t CNPUD12:1;
      uint16_t CNPUD13:1;
      uint16_t CNPUD14:1;
      uint16_t CNPUD15:1;
    };
  };
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define IOCPUD IOCPUD
extern volatile uint16_t IOCPUD __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUDBITS {
  union {
    struct {
      uint16_t IOCPD0:1;
      uint16_t IOCPD1:1;
      uint16_t IOCPD2:1;
      uint16_t IOCPD3:1;
      uint16_t IOCPD4:1;
      uint16_t IOCPD5:1;
      uint16_t IOCPD6:1;
      uint16_t IOCPD7:1;
      uint16_t IOCPD8:1;
      uint16_t IOCPD9:1;
      uint16_t IOCPD10:1;
      uint16_t IOCPD11:1;
      uint16_t IOCPD12:1;
      uint16_t IOCPD13:1;
      uint16_t IOCPD14:1;
      uint16_t IOCPD15:1;
    };
    struct {
      uint16_t IOCPUD0:1;
      uint16_t IOCPUD1:1;
      uint16_t IOCPUD2:1;
      uint16_t IOCPUD3:1;
      uint16_t IOCPUD4:1;
      uint16_t IOCPUD5:1;
      uint16_t IOCPUD6:1;
      uint16_t IOCPUD7:1;
      uint16_t IOCPUD8:1;
      uint16_t IOCPUD9:1;
      uint16_t IOCPUD10:1;
      uint16_t IOCPUD11:1;
      uint16_t IOCPUD12:1;
      uint16_t IOCPUD13:1;
      uint16_t IOCPUD14:1;
      uint16_t IOCPUD15:1;
    };
    struct {
      uint16_t CNPUD0:1;
      uint16_t CNPUD1:1;
      uint16_t CNPUD2:1;
      uint16_t CNPUD3:1;
      uint16_t CNPUD4:1;
      uint16_t CNPUD5:1;
      uint16_t CNPUD6:1;
      uint16_t CNPUD7:1;
      uint16_t CNPUD8:1;
      uint16_t CNPUD9:1;
      uint16_t CNPUD10:1;
      uint16_t CNPUD11:1;
      uint16_t CNPUD12:1;
      uint16_t CNPUD13:1;
      uint16_t CNPUD14:1;
      uint16_t CNPUD15:1;
    };
  };
} IOCPUDBITS;
extern volatile IOCPUDBITS IOCPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile uint16_t CNPDD __attribute__((__sfr__));
__extension__ typedef struct tagCNPDDBITS {
  union {
    struct {
      uint16_t IOCPDD0:1;
      uint16_t IOCPDD1:1;
      uint16_t IOCPDD2:1;
      uint16_t IOCPDD3:1;
      uint16_t IOCPDD4:1;
      uint16_t IOCPDD5:1;
      uint16_t IOCPDD6:1;
      uint16_t IOCPDD7:1;
      uint16_t IOCPDD8:1;
      uint16_t IOCPDD9:1;
      uint16_t IOCPDD10:1;
      uint16_t IOCPDD11:1;
      uint16_t IOCPDD12:1;
      uint16_t IOCPDD13:1;
      uint16_t IOCPDD14:1;
      uint16_t IOCPDD15:1;
    };
    struct {
      uint16_t CNPDD0:1;
      uint16_t CNPDD1:1;
      uint16_t CNPDD2:1;
      uint16_t CNPDD3:1;
      uint16_t CNPDD4:1;
      uint16_t CNPDD5:1;
      uint16_t CNPDD6:1;
      uint16_t CNPDD7:1;
      uint16_t CNPDD8:1;
      uint16_t CNPDD9:1;
      uint16_t CNPDD10:1;
      uint16_t CNPDD11:1;
      uint16_t CNPDD12:1;
      uint16_t CNPDD13:1;
      uint16_t CNPDD14:1;
      uint16_t CNPDD15:1;
    };
  };
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define IOCPDD IOCPDD
extern volatile uint16_t IOCPDD __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDDBITS {
  union {
    struct {
      uint16_t IOCPDD0:1;
      uint16_t IOCPDD1:1;
      uint16_t IOCPDD2:1;
      uint16_t IOCPDD3:1;
      uint16_t IOCPDD4:1;
      uint16_t IOCPDD5:1;
      uint16_t IOCPDD6:1;
      uint16_t IOCPDD7:1;
      uint16_t IOCPDD8:1;
      uint16_t IOCPDD9:1;
      uint16_t IOCPDD10:1;
      uint16_t IOCPDD11:1;
      uint16_t IOCPDD12:1;
      uint16_t IOCPDD13:1;
      uint16_t IOCPDD14:1;
      uint16_t IOCPDD15:1;
    };
    struct {
      uint16_t CNPDD0:1;
      uint16_t CNPDD1:1;
      uint16_t CNPDD2:1;
      uint16_t CNPDD3:1;
      uint16_t CNPDD4:1;
      uint16_t CNPDD5:1;
      uint16_t CNPDD6:1;
      uint16_t CNPDD7:1;
      uint16_t CNPDD8:1;
      uint16_t CNPDD9:1;
      uint16_t CNPDD10:1;
      uint16_t CNPDD11:1;
      uint16_t CNPDD12:1;
      uint16_t CNPDD13:1;
      uint16_t CNPDD14:1;
      uint16_t CNPDD15:1;
    };
  };
} IOCPDDBITS;
