MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB410/mcu.h
/* CNPDD */
#define _IOCPDD0 CNPDDbits.IOCPDD0
#define _IOCPDD1 CNPDDbits.IOCPDD1
#define _IOCPDD2 CNPDDbits.IOCPDD2
#define _IOCPDD3 CNPDDbits.IOCPDD3
#define _IOCPDD4 CNPDDbits.IOCPDD4
#define _IOCPDD5 CNPDDbits.IOCPDD5
#define _IOCPDD6 CNPDDbits.IOCPDD6
#define _IOCPDD7 CNPDDbits.IOCPDD7
#define _IOCPDD8 CNPDDbits.IOCPDD8
#define _IOCPDD9 CNPDDbits.IOCPDD9
#define _IOCPDD10 CNPDDbits.IOCPDD10
#define _IOCPDD11 CNPDDbits.IOCPDD11
#define _IOCPDD12 CNPDDbits.IOCPDD12
#define _IOCPDD13 CNPDDbits.IOCPDD13
#define _IOCPDD14 CNPDDbits.IOCPDD14
#define _IOCPDD15 CNPDDbits.IOCPDD15
#define _CNPDD0 CNPDDbits.CNPDD0
#define _CNPDD1 CNPDDbits.CNPDD1
#define _CNPDD2 CNPDDbits.CNPDD2
#define _CNPDD3 CNPDDbits.CNPDD3
#define _CNPDD4 CNPDDbits.CNPDD4
#define _CNPDD5 CNPDDbits.CNPDD5
#define _CNPDD6 CNPDDbits.CNPDD6
#define _CNPDD7 CNPDDbits.CNPDD7
#define _CNPDD8 CNPDDbits.CNPDD8
#define _CNPDD9 CNPDDbits.CNPDD9
#define _CNPDD10 CNPDDbits.CNPDD10
#define _CNPDD11 CNPDDbits.CNPDD11
#define _CNPDD12 CNPDDbits.CNPDD12
#define _CNPDD13 CNPDDbits.CNPDD13
#define _CNPDD14 CNPDDbits.CNPDD14
#define _CNPDD15 CNPDDbits.CNPDD15

/* TRISE */
#define _TRISE0 TRISEbits.TRISE0
#define _TRISE1 TRISEbits.TRISE1
#define _TRISE2 TRISEbits.TRISE2
#define _TRISE3 TRISEbits.TRISE3
#define _TRISE4 TRISEbits.TRISE4
#define _TRISE5 TRISEbits.TRISE5
#define _TRISE6 TRISEbits.TRISE6
#define _TRISE7 TRISEbits.TRISE7
#define _TRISE8 TRISEbits.TRISE8
#define _TRISE9 TRISEbits.TRISE9

/* PORTE */
#define _RE0 PORTEbits.RE0
#define _RE1 PORTEbits.RE1
#define _RE2 PORTEbits.RE2
#define _RE3 PORTEbits.RE3
#define _RE4 PORTEbits.RE4
#define _RE5 PORTEbits.RE5
#define _RE6 PORTEbits.RE6
#define _RE7 PORTEbits.RE7
#define _RE8 PORTEbits.RE8
#define _RE9 PORTEbits.RE9

/* LATE */
#define _LATE0 LATEbits.LATE0
#define _LATE1 LATEbits.LATE1
#define _LATE2 LATEbits.LATE2
#define _LATE3 LATEbits.LATE3
#define _LATE4 LATEbits.LATE4
#define _LATE5 LATEbits.LATE5
#define _LATE6 LATEbits.LATE6
#define _LATE7 LATEbits.LATE7
#define _LATE8 LATEbits.LATE8
#define _LATE9 LATEbits.LATE9

/* ODCE */
#define _ODCE0 ODCEbits.ODCE0
#define _ODCE1 ODCEbits.ODCE1
#define _ODCE2 ODCEbits.ODCE2
#define _ODCE3 ODCEbits.ODCE3
#define _ODCE4 ODCEbits.ODCE4
#define _ODCE5 ODCEbits.ODCE5
#define _ODCE6 ODCEbits.ODCE6
#define _ODCE7 ODCEbits.ODCE7
#define _ODCE8 ODCEbits.ODCE8
#define _ODCE9 ODCEbits.ODCE9

/* ANSE */
#define _ANSE0 ANSEbits.ANSE0
#define _ANSE1 ANSEbits.ANSE1
#define _ANSE2 ANSEbits.ANSE2
#define _ANSE3 ANSEbits.ANSE3
#define _ANSE4 ANSEbits.ANSE4
#define _ANSE5 ANSEbits.ANSE5
#define _ANSE6 ANSEbits.ANSE6
#define _ANSE7 ANSEbits.ANSE7
#define _ANSE8 ANSEbits.ANSE8
#define _ANSE9 ANSEbits.ANSE9
#define _ANSELE0 ANSEbits.ANSELE0
#define _ANSELE1 ANSEbits.ANSELE1
#define _ANSELE2 ANSEbits.ANSELE2
#define _ANSELE3 ANSEbits.ANSELE3
#define _ANSELE4 ANSEbits.ANSELE4
#define _ANSELE5 ANSEbits.ANSELE5
#define _ANSELE6 ANSEbits.ANSELE6
#define _ANSELE7 ANSEbits.ANSELE7
#define _ANSELE8 ANSEbits.ANSELE8
#define _ANSELE9 ANSEbits.ANSELE9

/* IOCPE */
/* Bitname _IOCPE0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE9 cannot be defined because it is used by more than one SFR */

/* IOCNE */
#define _IOCNE0 IOCNEbits.IOCNE0
#define _IOCNE1 IOCNEbits.IOCNE1
#define _IOCNE2 IOCNEbits.IOCNE2
#define _IOCNE3 IOCNEbits.IOCNE3
#define _IOCNE4 IOCNEbits.IOCNE4
#define _IOCNE5 IOCNEbits.IOCNE5
#define _IOCNE6 IOCNEbits.IOCNE6
#define _IOCNE7 IOCNEbits.IOCNE7
#define _IOCNE8 IOCNEbits.IOCNE8
#define _IOCNE9 IOCNEbits.IOCNE9

/* IOCFE */
#define _IOCFE0 IOCFEbits.IOCFE0
#define _IOCFE1 IOCFEbits.IOCFE1
#define _IOCFE2 IOCFEbits.IOCFE2
#define _IOCFE3 IOCFEbits.IOCFE3
#define _IOCFE4 IOCFEbits.IOCFE4
#define _IOCFE5 IOCFEbits.IOCFE5
#define _IOCFE6 IOCFEbits.IOCFE6
#define _IOCFE7 IOCFEbits.IOCFE7
#define _IOCFE8 IOCFEbits.IOCFE8
#define _IOCFE9 IOCFEbits.IOCFE9

/* CNPUE */
/* Bitname _IOCPE0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE9 cannot be defined because it is used by more than one SFR */
#define _IOCPUE0 CNPUEbits.IOCPUE0
#define _IOCPUE1 CNPUEbits.IOCPUE1
#define _IOCPUE2 CNPUEbits.IOCPUE2
#define _IOCPUE3 CNPUEbits.IOCPUE3
#define _IOCPUE4 CNPUEbits.IOCPUE4
#define _IOCPUE5 CNPUEbits.IOCPUE5
#define _IOCPUE6 CNPUEbits.IOCPUE6
#define _IOCPUE7 CNPUEbits.IOCPUE7
#define _IOCPUE8 CNPUEbits.IOCPUE8
#define _IOCPUE9 CNPUEbits.IOCPUE9
#define _CNPUE0 CNPUEbits.CNPUE0
#define _CNPUE1 CNPUEbits.CNPUE1
#define _CNPUE2 CNPUEbits.CNPUE2
#define _CNPUE3 CNPUEbits.CNPUE3
#define _CNPUE4 CNPUEbits.CNPUE4
#define _CNPUE5 CNPUEbits.CNPUE5
#define _CNPUE6 CNPUEbits.CNPUE6
#define _CNPUE7 CNPUEbits.CNPUE7
#define _CNPUE8 CNPUEbits.CNPUE8
#define _CNPUE9 CNPUEbits.CNPUE9

/* CNPDE */
#define _IOCPDE0 CNPDEbits.IOCPDE0
#define _IOCPDE1 CNPDEbits.IOCPDE1
#define _IOCPDE2 CNPDEbits.IOCPDE2
#define _IOCPDE3 CNPDEbits.IOCPDE3
#define _IOCPDE4 CNPDEbits.IOCPDE4
#define _IOCPDE5 CNPDEbits.IOCPDE5
#define _IOCPDE6 CNPDEbits.IOCPDE6
#define _IOCPDE7 CNPDEbits.IOCPDE7
#define _IOCPDE8 CNPDEbits.IOCPDE8
#define _IOCPDE9 CNPDEbits.IOCPDE9
#define _CNPDE0 CNPDEbits.CNPDE0
#define _CNPDE1 CNPDEbits.CNPDE1
#define _CNPDE2 CNPDEbits.CNPDE2
#define _CNPDE3 CNPDEbits.CNPDE3
#define _CNPDE4 CNPDEbits.CNPDE4
#define _CNPDE5 CNPDEbits.CNPDE5
#define _CNPDE6 CNPDEbits.CNPDE6
#define _CNPDE7 CNPDEbits.CNPDE7
#define _CNPDE8 CNPDEbits.CNPDE8
#define _CNPDE9 CNPDEbits.CNPDE9

/* TRISF */
#define _TRISF0 TRISFbits.TRISF0
#define _TRISF1 TRISFbits.TRISF1
#define _TRISF2 TRISFbits.TRISF2
#define _TRISF3 TRISFbits.TRISF3
#define _TRISF4 TRISFbits.TRISF4
#define _TRISF5 TRISFbits.TRISF5
#define _TRISF6 TRISFbits.TRISF6
#define _TRISF7 TRISFbits.TRISF7
#define _TRISF8 TRISFbits.TRISF8
#define _TRISF12 TRISFbits.TRISF12
#define _TRISF13 TRISFbits.TRISF13

/* PORTF */
#define _RF0 PORTFbits.RF0
#define _RF1 PORTFbits.RF1
#define _RF2 PORTFbits.RF2
#define _RF3 PORTFbits.RF3
#define _RF4 PORTFbits.RF4
#define _RF5 PORTFbits.RF5
#define _RF6 PORTFbits.RF6
#define _RF7 PORTFbits.RF7
#define _RF8 PORTFbits.RF8
#define _RF12 PORTFbits.RF12
#define _RF13 PORTFbits.RF13

/* LATF */
#define _LATF0 LATFbits.LATF0
#define _LATF1 LATFbits.LATF1
#define _LATF2 LATFbits.LATF2
#define _LATF3 LATFbits.LATF3
#define _LATF4 LATFbits.LATF4
#define _LATF5 LATFbits.LATF5
#define _LATF6 LATFbits.LATF6
#define _LATF7 LATFbits.LATF7
#define _LATF8 LATFbits.LATF8
#define _LATF12 LATFbits.LATF12
#define _LATF13 LATFbits.LATF13

/* ODCF */
#define _ODCF0 ODCFbits.ODCF0
#define _ODCF1 ODCFbits.ODCF1
#define _ODCF2 ODCFbits.ODCF2
#define _ODCF3 ODCFbits.ODCF3
#define _ODCF4 ODCFbits.ODCF4
#define _ODCF5 ODCFbits.ODCF5
#define _ODCF6 ODCFbits.ODCF6
#define _ODCF7 ODCFbits.ODCF7
#define _ODCF8 ODCFbits.ODCF8
#define _ODCF12 ODCFbits.ODCF12
#define _ODCF13 ODCFbits.ODCF13

/* ANSELF */
#define _ANSF0 ANSELFbits.ANSF0
#define _ANSF1 ANSELFbits.ANSF1
#define _ANSF2 ANSELFbits.ANSF2
#define _ANSF3 ANSELFbits.ANSF3
#define _ANSF4 ANSELFbits.ANSF4
#define _ANSF5 ANSELFbits.ANSF5
#define _ANSF8 ANSELFbits.ANSF8
#define _ANSF12 ANSELFbits.ANSF12
#define _ANSF13 ANSELFbits.ANSF13
#define _ANSELF0 ANSELFbits.ANSELF0
#define _ANSELF1 ANSELFbits.ANSELF1
#define _ANSELF2 ANSELFbits.ANSELF2
#define _ANSELF3 ANSELFbits.ANSELF3
#define _ANSELF4 ANSELFbits.ANSELF4
#define _ANSELF5 ANSELFbits.ANSELF5
#define _ANSELF8 ANSELFbits.ANSELF8
#define _ANSELF12 ANSELFbits.ANSELF12
#define _ANSELF13 ANSELFbits.ANSELF13

