MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB410/mcu.h
#define _IEC3_KEYSTRIE_POSITION                  0x00000008
#define _IEC3_KEYSTRIE_MASK                      0x00000100
#define _IEC3_KEYSTRIE_LENGTH                    0x00000001

#define _IEC3_SPI4RXIE_POSITION                  0x00000009
#define _IEC3_SPI4RXIE_MASK                      0x00000200
#define _IEC3_SPI4RXIE_LENGTH                    0x00000001

#define _IEC3_SPI1RXIE_POSITION                  0x0000000A
#define _IEC3_SPI1RXIE_MASK                      0x00000400
#define _IEC3_SPI1RXIE_LENGTH                    0x00000001

#define _IEC3_SPI2RXIE_POSITION                  0x0000000B
#define _IEC3_SPI2RXIE_MASK                      0x00000800
#define _IEC3_SPI2RXIE_LENGTH                    0x00000001

#define _IEC3_SPI3RXIE_POSITION                  0x0000000C
#define _IEC3_SPI3RXIE_MASK                      0x00001000
#define _IEC3_SPI3RXIE_LENGTH                    0x00000001

#define _IEC3_DMA5IE_POSITION                    0x0000000D
#define _IEC3_DMA5IE_MASK                        0x00002000
#define _IEC3_DMA5IE_LENGTH                      0x00000001

#define _IEC3_RTCIE_POSITION                     0x0000000E
#define _IEC3_RTCIE_MASK                         0x00004000
#define _IEC3_RTCIE_LENGTH                       0x00000001

#define _IEC3_CCP1IE_POSITION                    0x0000000F
#define _IEC3_CCP1IE_MASK                        0x00008000
#define _IEC3_CCP1IE_LENGTH                      0x00000001

#define _IEC4_CCP2IE_POSITION                    0x00000000
#define _IEC4_CCP2IE_MASK                        0x00000001
#define _IEC4_CCP2IE_LENGTH                      0x00000001

#define _IEC4_U1ERIE_POSITION                    0x00000001
#define _IEC4_U1ERIE_MASK                        0x00000002
#define _IEC4_U1ERIE_LENGTH                      0x00000001

#define _IEC4_U2ERIE_POSITION                    0x00000002
#define _IEC4_U2ERIE_MASK                        0x00000004
#define _IEC4_U2ERIE_LENGTH                      0x00000001

#define _IEC4_CRCIE_POSITION                     0x00000003
#define _IEC4_CRCIE_MASK                         0x00000008
#define _IEC4_CRCIE_LENGTH                       0x00000001

#define _IEC4_SI2C3IE_POSITION                   0x00000006
#define _IEC4_SI2C3IE_MASK                       0x00000040
#define _IEC4_SI2C3IE_LENGTH                     0x00000001

#define _IEC4_MI2C3IE_POSITION                   0x00000007
#define _IEC4_MI2C3IE_MASK                       0x00000080
#define _IEC4_MI2C3IE_LENGTH                     0x00000001

#define _IEC4_LVDIE_POSITION                     0x00000008
#define _IEC4_LVDIE_MASK                         0x00000100
#define _IEC4_LVDIE_LENGTH                       0x00000001

#define _IEC4_CCP7IE_POSITION                    0x00000009
#define _IEC4_CCP7IE_MASK                        0x00000200
#define _IEC4_CCP7IE_LENGTH                      0x00000001

#define _IEC4_CTMUIE_POSITION                    0x0000000D
#define _IEC4_CTMUIE_MASK                        0x00002000
#define _IEC4_CTMUIE_LENGTH                      0x00000001

#define _IEC4_DAC1IE_POSITION                    0x0000000E
#define _IEC4_DAC1IE_MASK                        0x00004000
#define _IEC4_DAC1IE_LENGTH                      0x00000001

#define _IEC5_U3ERIE_POSITION                    0x00000001
#define _IEC5_U3ERIE_MASK                        0x00000002
#define _IEC5_U3ERIE_LENGTH                      0x00000001

#define _IEC5_U3RXIE_POSITION                    0x00000002
#define _IEC5_U3RXIE_MASK                        0x00000004
#define _IEC5_U3RXIE_LENGTH                      0x00000001

#define _IEC5_U3TXIE_POSITION                    0x00000003
#define _IEC5_U3TXIE_MASK                        0x00000008
#define _IEC5_U3TXIE_LENGTH                      0x00000001

#define _IEC5_I2C1BCIE_POSITION                  0x00000004
#define _IEC5_I2C1BCIE_MASK                      0x00000010
#define _IEC5_I2C1BCIE_LENGTH                    0x00000001

#define _IEC5_I2C2BCIE_POSITION                  0x00000005
#define _IEC5_I2C2BCIE_MASK                      0x00000020
#define _IEC5_I2C2BCIE_LENGTH                    0x00000001

#define _IEC5_USB1IE_POSITION                    0x00000006
#define _IEC5_USB1IE_MASK                        0x00000040
#define _IEC5_USB1IE_LENGTH                      0x00000001

#define _IEC5_U4ERIE_POSITION                    0x00000007
#define _IEC5_U4ERIE_MASK                        0x00000080
#define _IEC5_U4ERIE_LENGTH                      0x00000001

#define _IEC5_U4RXIE_POSITION                    0x00000008
#define _IEC5_U4RXIE_MASK                        0x00000100
#define _IEC5_U4RXIE_LENGTH                      0x00000001

#define _IEC5_U4TXIE_POSITION                    0x00000009
#define _IEC5_U4TXIE_MASK                        0x00000200
#define _IEC5_U4TXIE_LENGTH                      0x00000001

#define _IEC5_SPI3IE_POSITION                    0x0000000A
#define _IEC5_SPI3IE_MASK                        0x00000400
#define _IEC5_SPI3IE_LENGTH                      0x00000001

#define _IEC5_SPI3TXIE_POSITION                  0x0000000B
#define _IEC5_SPI3TXIE_MASK                      0x00000800
#define _IEC5_SPI3TXIE_LENGTH                    0x00000001

#define _IEC5_SPI4IE_POSITION                    0x0000000C
#define _IEC5_SPI4IE_MASK                        0x00001000
#define _IEC5_SPI4IE_LENGTH                      0x00000001

#define _IEC5_SPI4TXIE_POSITION                  0x0000000D
#define _IEC5_SPI4TXIE_MASK                      0x00002000
#define _IEC5_SPI4TXIE_LENGTH                    0x00000001

#define _IEC5_CCP3IE_POSITION                    0x0000000E
#define _IEC5_CCP3IE_MASK                        0x00004000
#define _IEC5_CCP3IE_LENGTH                      0x00000001

#define _IEC5_CCP4IE_POSITION                    0x0000000F
#define _IEC5_CCP4IE_MASK                        0x00008000
#define _IEC5_CCP4IE_LENGTH                      0x00000001

#define _IEC6_CLC1IE_POSITION                    0x00000000
#define _IEC6_CLC1IE_MASK                        0x00000001
#define _IEC6_CLC1IE_LENGTH                      0x00000001

#define _IEC6_CLC2IE_POSITION                    0x00000001
#define _IEC6_CLC2IE_MASK                        0x00000002
#define _IEC6_CLC2IE_LENGTH                      0x00000001

#define _IEC6_CLC3IE_POSITION                    0x00000002
#define _IEC6_CLC3IE_MASK                        0x00000004
#define _IEC6_CLC3IE_LENGTH                      0x00000001

