MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB410/mcu.h
#define _CCP6CON1H_OPS3_POSITION                 0x0000000B
#define _CCP6CON1H_OPS3_MASK                     0x00000800
#define _CCP6CON1H_OPS3_LENGTH                   0x00000001

#define _CCP6CON1H_OPSRC_POSITION                0x0000000F
#define _CCP6CON1H_OPSRC_MASK                    0x00008000
#define _CCP6CON1H_OPSRC_LENGTH                  0x00000001

#define _CCP6CON1H_IOPS_POSITION                 0x00000008
#define _CCP6CON1H_IOPS_MASK                     0x00000F00
#define _CCP6CON1H_IOPS_LENGTH                   0x00000004

#define _CCP6CON1H_IOPS0_POSITION                0x00000008
#define _CCP6CON1H_IOPS0_MASK                    0x00000100
#define _CCP6CON1H_IOPS0_LENGTH                  0x00000001

#define _CCP6CON1H_IOPS1_POSITION                0x00000009
#define _CCP6CON1H_IOPS1_MASK                    0x00000200
#define _CCP6CON1H_IOPS1_LENGTH                  0x00000001

#define _CCP6CON1H_IOPS2_POSITION                0x0000000A
#define _CCP6CON1H_IOPS2_MASK                    0x00000400
#define _CCP6CON1H_IOPS2_LENGTH                  0x00000001

#define _CCP6CON1H_IOPS3_POSITION                0x0000000B
#define _CCP6CON1H_IOPS3_MASK                    0x00000800
#define _CCP6CON1H_IOPS3_LENGTH                  0x00000001

#define _CCP6CON2L_ASDG_POSITION                 0x00000000
#define _CCP6CON2L_ASDG_MASK                     0x000000FF
#define _CCP6CON2L_ASDG_LENGTH                   0x00000008

#define _CCP6CON2L_SSDG_POSITION                 0x0000000C
#define _CCP6CON2L_SSDG_MASK                     0x00001000
#define _CCP6CON2L_SSDG_LENGTH                   0x00000001

#define _CCP6CON2L_ASDGM_POSITION                0x0000000E
#define _CCP6CON2L_ASDGM_MASK                    0x00004000
#define _CCP6CON2L_ASDGM_LENGTH                  0x00000001

#define _CCP6CON2L_PWMRSEN_POSITION              0x0000000F
#define _CCP6CON2L_PWMRSEN_MASK                  0x00008000
#define _CCP6CON2L_PWMRSEN_LENGTH                0x00000001

#define _CCP6CON2L_ASDG0_POSITION                0x00000000
#define _CCP6CON2L_ASDG0_MASK                    0x00000001
#define _CCP6CON2L_ASDG0_LENGTH                  0x00000001

#define _CCP6CON2L_ASDG1_POSITION                0x00000001
#define _CCP6CON2L_ASDG1_MASK                    0x00000002
#define _CCP6CON2L_ASDG1_LENGTH                  0x00000001

#define _CCP6CON2L_ASDG2_POSITION                0x00000002
#define _CCP6CON2L_ASDG2_MASK                    0x00000004
#define _CCP6CON2L_ASDG2_LENGTH                  0x00000001

#define _CCP6CON2L_ASDG3_POSITION                0x00000003
#define _CCP6CON2L_ASDG3_MASK                    0x00000008
#define _CCP6CON2L_ASDG3_LENGTH                  0x00000001

#define _CCP6CON2L_ASDG4_POSITION                0x00000004
#define _CCP6CON2L_ASDG4_MASK                    0x00000010
#define _CCP6CON2L_ASDG4_LENGTH                  0x00000001

#define _CCP6CON2L_ASDG5_POSITION                0x00000005
#define _CCP6CON2L_ASDG5_MASK                    0x00000020
#define _CCP6CON2L_ASDG5_LENGTH                  0x00000001

#define _CCP6CON2L_ASDG6_POSITION                0x00000006
#define _CCP6CON2L_ASDG6_MASK                    0x00000040
#define _CCP6CON2L_ASDG6_LENGTH                  0x00000001

#define _CCP6CON2L_ASDG7_POSITION                0x00000007
#define _CCP6CON2L_ASDG7_MASK                    0x00000080
#define _CCP6CON2L_ASDG7_LENGTH                  0x00000001

#define _CCP6CON2H_ICS_POSITION                  0x00000000
#define _CCP6CON2H_ICS_MASK                      0x00000007
#define _CCP6CON2H_ICS_LENGTH                    0x00000003

#define _CCP6CON2H_AUXOUT_POSITION               0x00000003
#define _CCP6CON2H_AUXOUT_MASK                   0x00000018
#define _CCP6CON2H_AUXOUT_LENGTH                 0x00000002

#define _CCP6CON2H_ICGSM_POSITION                0x00000006
#define _CCP6CON2H_ICGSM_MASK                    0x000000C0
#define _CCP6CON2H_ICGSM_LENGTH                  0x00000002

#define _CCP6CON2H_OCAEN_POSITION                0x00000008
#define _CCP6CON2H_OCAEN_MASK                    0x00000100
#define _CCP6CON2H_OCAEN_LENGTH                  0x00000001

#define _CCP6CON2H_OENSYNC_POSITION              0x0000000F
#define _CCP6CON2H_OENSYNC_MASK                  0x00008000
#define _CCP6CON2H_OENSYNC_LENGTH                0x00000001

#define _CCP6CON2H_ICS0_POSITION                 0x00000000
#define _CCP6CON2H_ICS0_MASK                     0x00000001
#define _CCP6CON2H_ICS0_LENGTH                   0x00000001

#define _CCP6CON2H_ICS1_POSITION                 0x00000001
#define _CCP6CON2H_ICS1_MASK                     0x00000002
#define _CCP6CON2H_ICS1_LENGTH                   0x00000001

#define _CCP6CON2H_ICS2_POSITION                 0x00000002
#define _CCP6CON2H_ICS2_MASK                     0x00000004
#define _CCP6CON2H_ICS2_LENGTH                   0x00000001

#define _CCP6CON2H_AUXOUT0_POSITION              0x00000003
#define _CCP6CON2H_AUXOUT0_MASK                  0x00000008
#define _CCP6CON2H_AUXOUT0_LENGTH                0x00000001

#define _CCP6CON2H_AUXOUT1_POSITION              0x00000004
#define _CCP6CON2H_AUXOUT1_MASK                  0x00000010
#define _CCP6CON2H_AUXOUT1_LENGTH                0x00000001

#define _CCP6CON2H_ICGSM0_POSITION               0x00000006
#define _CCP6CON2H_ICGSM0_MASK                   0x00000040
#define _CCP6CON2H_ICGSM0_LENGTH                 0x00000001

#define _CCP6CON2H_ICGSM1_POSITION               0x00000007
#define _CCP6CON2H_ICGSM1_MASK                   0x00000080
#define _CCP6CON2H_ICGSM1_LENGTH                 0x00000001

#define _CCP6CON2H_ICSEL_POSITION                0x00000000
#define _CCP6CON2H_ICSEL_MASK                    0x00000007
#define _CCP6CON2H_ICSEL_LENGTH                  0x00000003

#define _CCP6CON2H_ICSEL0_POSITION               0x00000000
#define _CCP6CON2H_ICSEL0_MASK                   0x00000001
#define _CCP6CON2H_ICSEL0_LENGTH                 0x00000001

#define _CCP6CON2H_ICSEL1_POSITION               0x00000001
#define _CCP6CON2H_ICSEL1_MASK                   0x00000002
#define _CCP6CON2H_ICSEL1_LENGTH                 0x00000001

