MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB410/mcu.h
#define _ANSA_ANSA9_POSITION                     0x00000009
#define _ANSA_ANSA9_MASK                         0x00000200
#define _ANSA_ANSA9_LENGTH                       0x00000001

#define _ANSA_ANSA10_POSITION                    0x0000000A
#define _ANSA_ANSA10_MASK                        0x00000400
#define _ANSA_ANSA10_LENGTH                      0x00000001

#define _ANSA_ANSA14_POSITION                    0x0000000E
#define _ANSA_ANSA14_MASK                        0x00004000
#define _ANSA_ANSA14_LENGTH                      0x00000001

#define _ANSA_ANSA15_POSITION                    0x0000000F
#define _ANSA_ANSA15_MASK                        0x00008000
#define _ANSA_ANSA15_LENGTH                      0x00000001

#define _ANSA_ANSELA0_POSITION                   0x00000000
#define _ANSA_ANSELA0_MASK                       0x00000001
#define _ANSA_ANSELA0_LENGTH                     0x00000001

#define _ANSA_ANSELA2_POSITION                   0x00000002
#define _ANSA_ANSELA2_MASK                       0x00000004
#define _ANSA_ANSELA2_LENGTH                     0x00000001

#define _ANSA_ANSELA3_POSITION                   0x00000003
#define _ANSA_ANSELA3_MASK                       0x00000008
#define _ANSA_ANSELA3_LENGTH                     0x00000001

#define _ANSA_ANSELA5_POSITION                   0x00000005
#define _ANSA_ANSELA5_MASK                       0x00000020
#define _ANSA_ANSELA5_LENGTH                     0x00000001

#define _ANSA_ANSELA6_POSITION                   0x00000006
#define _ANSA_ANSELA6_MASK                       0x00000040
#define _ANSA_ANSELA6_LENGTH                     0x00000001

#define _ANSA_ANSELA7_POSITION                   0x00000007
#define _ANSA_ANSELA7_MASK                       0x00000080
#define _ANSA_ANSELA7_LENGTH                     0x00000001

#define _ANSA_ANSELA9_POSITION                   0x00000009
#define _ANSA_ANSELA9_MASK                       0x00000200
#define _ANSA_ANSELA9_LENGTH                     0x00000001

#define _ANSA_ANSELA10_POSITION                  0x0000000A
#define _ANSA_ANSELA10_MASK                      0x00000400
#define _ANSA_ANSELA10_LENGTH                    0x00000001

#define _ANSA_ANSELA14_POSITION                  0x0000000E
#define _ANSA_ANSELA14_MASK                      0x00004000
#define _ANSA_ANSELA14_LENGTH                    0x00000001

#define _ANSA_ANSELA15_POSITION                  0x0000000F
#define _ANSA_ANSELA15_MASK                      0x00008000
#define _ANSA_ANSELA15_LENGTH                    0x00000001

#define _ANSELA_ANSA0_POSITION                   0x00000000
#define _ANSELA_ANSA0_MASK                       0x00000001
#define _ANSELA_ANSA0_LENGTH                     0x00000001

#define _ANSELA_ANSA2_POSITION                   0x00000002
#define _ANSELA_ANSA2_MASK                       0x00000004
#define _ANSELA_ANSA2_LENGTH                     0x00000001

#define _ANSELA_ANSA3_POSITION                   0x00000003
#define _ANSELA_ANSA3_MASK                       0x00000008
#define _ANSELA_ANSA3_LENGTH                     0x00000001

#define _ANSELA_ANSA5_POSITION                   0x00000005
#define _ANSELA_ANSA5_MASK                       0x00000020
#define _ANSELA_ANSA5_LENGTH                     0x00000001

#define _ANSELA_ANSA6_POSITION                   0x00000006
#define _ANSELA_ANSA6_MASK                       0x00000040
#define _ANSELA_ANSA6_LENGTH                     0x00000001

#define _ANSELA_ANSA7_POSITION                   0x00000007
#define _ANSELA_ANSA7_MASK                       0x00000080
#define _ANSELA_ANSA7_LENGTH                     0x00000001

#define _ANSELA_ANSA9_POSITION                   0x00000009
#define _ANSELA_ANSA9_MASK                       0x00000200
#define _ANSELA_ANSA9_LENGTH                     0x00000001

#define _ANSELA_ANSA10_POSITION                  0x0000000A
#define _ANSELA_ANSA10_MASK                      0x00000400
#define _ANSELA_ANSA10_LENGTH                    0x00000001

#define _ANSELA_ANSA14_POSITION                  0x0000000E
#define _ANSELA_ANSA14_MASK                      0x00004000
#define _ANSELA_ANSA14_LENGTH                    0x00000001

#define _ANSELA_ANSA15_POSITION                  0x0000000F
#define _ANSELA_ANSA15_MASK                      0x00008000
#define _ANSELA_ANSA15_LENGTH                    0x00000001

#define _ANSELA_ANSELA0_POSITION                 0x00000000
#define _ANSELA_ANSELA0_MASK                     0x00000001
#define _ANSELA_ANSELA0_LENGTH                   0x00000001

#define _ANSELA_ANSELA2_POSITION                 0x00000002
#define _ANSELA_ANSELA2_MASK                     0x00000004
#define _ANSELA_ANSELA2_LENGTH                   0x00000001

#define _ANSELA_ANSELA3_POSITION                 0x00000003
#define _ANSELA_ANSELA3_MASK                     0x00000008
#define _ANSELA_ANSELA3_LENGTH                   0x00000001

#define _ANSELA_ANSELA5_POSITION                 0x00000005
#define _ANSELA_ANSELA5_MASK                     0x00000020
#define _ANSELA_ANSELA5_LENGTH                   0x00000001

#define _ANSELA_ANSELA6_POSITION                 0x00000006
#define _ANSELA_ANSELA6_MASK                     0x00000040
#define _ANSELA_ANSELA6_LENGTH                   0x00000001

#define _ANSELA_ANSELA7_POSITION                 0x00000007
#define _ANSELA_ANSELA7_MASK                     0x00000080
#define _ANSELA_ANSELA7_LENGTH                   0x00000001

#define _ANSELA_ANSELA9_POSITION                 0x00000009
#define _ANSELA_ANSELA9_MASK                     0x00000200
#define _ANSELA_ANSELA9_LENGTH                   0x00000001

#define _ANSELA_ANSELA10_POSITION                0x0000000A
#define _ANSELA_ANSELA10_MASK                    0x00000400
#define _ANSELA_ANSELA10_LENGTH                  0x00000001

#define _ANSELA_ANSELA14_POSITION                0x0000000E
#define _ANSELA_ANSELA14_MASK                    0x00004000
#define _ANSELA_ANSELA14_LENGTH                  0x00000001

#define _ANSELA_ANSELA15_POSITION                0x0000000F
#define _ANSELA_ANSELA15_MASK                    0x00008000
#define _ANSELA_ANSELA15_LENGTH                  0x00000001

#define _IOCPA_IOCPA0_POSITION                   0x00000000
#define _IOCPA_IOCPA0_MASK                       0x00000001
#define _IOCPA_IOCPA0_LENGTH                     0x00000001

#define _IOCPA_IOCPA1_POSITION                   0x00000001
#define _IOCPA_IOCPA1_MASK                       0x00000002
#define _IOCPA_IOCPA1_LENGTH                     0x00000001

