MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB410/mcu.h
#define _IOCPUC_CNPUC1_POSITION                  0x00000001
#define _IOCPUC_CNPUC1_MASK                      0x00000002
#define _IOCPUC_CNPUC1_LENGTH                    0x00000001

#define _IOCPUC_CNPUC2_POSITION                  0x00000002
#define _IOCPUC_CNPUC2_MASK                      0x00000004
#define _IOCPUC_CNPUC2_LENGTH                    0x00000001

#define _IOCPUC_CNPUC3_POSITION                  0x00000003
#define _IOCPUC_CNPUC3_MASK                      0x00000008
#define _IOCPUC_CNPUC3_LENGTH                    0x00000001

#define _IOCPUC_CNPUC4_POSITION                  0x00000004
#define _IOCPUC_CNPUC4_MASK                      0x00000010
#define _IOCPUC_CNPUC4_LENGTH                    0x00000001

#define _IOCPUC_CNPUC12_POSITION                 0x0000000C
#define _IOCPUC_CNPUC12_MASK                     0x00001000
#define _IOCPUC_CNPUC12_LENGTH                   0x00000001

#define _IOCPUC_CNPUC15_POSITION                 0x0000000F
#define _IOCPUC_CNPUC15_MASK                     0x00008000
#define _IOCPUC_CNPUC15_LENGTH                   0x00000001

#define _CNPDC_IOCPDC1_POSITION                  0x00000001
#define _CNPDC_IOCPDC1_MASK                      0x00000002
#define _CNPDC_IOCPDC1_LENGTH                    0x00000001

#define _CNPDC_IOCPDC2_POSITION                  0x00000002
#define _CNPDC_IOCPDC2_MASK                      0x00000004
#define _CNPDC_IOCPDC2_LENGTH                    0x00000001

#define _CNPDC_IOCPDC3_POSITION                  0x00000003
#define _CNPDC_IOCPDC3_MASK                      0x00000008
#define _CNPDC_IOCPDC3_LENGTH                    0x00000001

#define _CNPDC_IOCPDC4_POSITION                  0x00000004
#define _CNPDC_IOCPDC4_MASK                      0x00000010
#define _CNPDC_IOCPDC4_LENGTH                    0x00000001

#define _CNPDC_IOCPDC12_POSITION                 0x0000000C
#define _CNPDC_IOCPDC12_MASK                     0x00001000
#define _CNPDC_IOCPDC12_LENGTH                   0x00000001

#define _CNPDC_IOCPDC15_POSITION                 0x0000000F
#define _CNPDC_IOCPDC15_MASK                     0x00008000
#define _CNPDC_IOCPDC15_LENGTH                   0x00000001

#define _CNPDC_CNPDC1_POSITION                   0x00000001
#define _CNPDC_CNPDC1_MASK                       0x00000002
#define _CNPDC_CNPDC1_LENGTH                     0x00000001

#define _CNPDC_CNPDC2_POSITION                   0x00000002
#define _CNPDC_CNPDC2_MASK                       0x00000004
#define _CNPDC_CNPDC2_LENGTH                     0x00000001

#define _CNPDC_CNPDC3_POSITION                   0x00000003
#define _CNPDC_CNPDC3_MASK                       0x00000008
#define _CNPDC_CNPDC3_LENGTH                     0x00000001

#define _CNPDC_CNPDC4_POSITION                   0x00000004
#define _CNPDC_CNPDC4_MASK                       0x00000010
#define _CNPDC_CNPDC4_LENGTH                     0x00000001

#define _CNPDC_CNPDC12_POSITION                  0x0000000C
#define _CNPDC_CNPDC12_MASK                      0x00001000
#define _CNPDC_CNPDC12_LENGTH                    0x00000001

#define _CNPDC_CNPDC15_POSITION                  0x0000000F
#define _CNPDC_CNPDC15_MASK                      0x00008000
#define _CNPDC_CNPDC15_LENGTH                    0x00000001

#define _IOCPDC_IOCPDC1_POSITION                 0x00000001
#define _IOCPDC_IOCPDC1_MASK                     0x00000002
#define _IOCPDC_IOCPDC1_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC2_POSITION                 0x00000002
#define _IOCPDC_IOCPDC2_MASK                     0x00000004
#define _IOCPDC_IOCPDC2_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC3_POSITION                 0x00000003
#define _IOCPDC_IOCPDC3_MASK                     0x00000008
#define _IOCPDC_IOCPDC3_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC4_POSITION                 0x00000004
#define _IOCPDC_IOCPDC4_MASK                     0x00000010
#define _IOCPDC_IOCPDC4_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC12_POSITION                0x0000000C
#define _IOCPDC_IOCPDC12_MASK                    0x00001000
#define _IOCPDC_IOCPDC12_LENGTH                  0x00000001

#define _IOCPDC_IOCPDC15_POSITION                0x0000000F
#define _IOCPDC_IOCPDC15_MASK                    0x00008000
#define _IOCPDC_IOCPDC15_LENGTH                  0x00000001

#define _IOCPDC_CNPDC1_POSITION                  0x00000001
#define _IOCPDC_CNPDC1_MASK                      0x00000002
#define _IOCPDC_CNPDC1_LENGTH                    0x00000001

#define _IOCPDC_CNPDC2_POSITION                  0x00000002
#define _IOCPDC_CNPDC2_MASK                      0x00000004
#define _IOCPDC_CNPDC2_LENGTH                    0x00000001

#define _IOCPDC_CNPDC3_POSITION                  0x00000003
#define _IOCPDC_CNPDC3_MASK                      0x00000008
#define _IOCPDC_CNPDC3_LENGTH                    0x00000001

#define _IOCPDC_CNPDC4_POSITION                  0x00000004
#define _IOCPDC_CNPDC4_MASK                      0x00000010
#define _IOCPDC_CNPDC4_LENGTH                    0x00000001

#define _IOCPDC_CNPDC12_POSITION                 0x0000000C
#define _IOCPDC_CNPDC12_MASK                     0x00001000
#define _IOCPDC_CNPDC12_LENGTH                   0x00000001

#define _IOCPDC_CNPDC15_POSITION                 0x0000000F
#define _IOCPDC_CNPDC15_MASK                     0x00008000
#define _IOCPDC_CNPDC15_LENGTH                   0x00000001

#define _TRISD_TRISD0_POSITION                   0x00000000
#define _TRISD_TRISD0_MASK                       0x00000001
#define _TRISD_TRISD0_LENGTH                     0x00000001

#define _TRISD_TRISD1_POSITION                   0x00000001
#define _TRISD_TRISD1_MASK                       0x00000002
#define _TRISD_TRISD1_LENGTH                     0x00000001

#define _TRISD_TRISD2_POSITION                   0x00000002
#define _TRISD_TRISD2_MASK                       0x00000004
#define _TRISD_TRISD2_LENGTH                     0x00000001

#define _TRISD_TRISD3_POSITION                   0x00000003
#define _TRISD_TRISD3_MASK                       0x00000008
#define _TRISD_TRISD3_LENGTH                     0x00000001

#define _TRISD_TRISD4_POSITION                   0x00000004
#define _TRISD_TRISD4_MASK                       0x00000010
#define _TRISD_TRISD4_LENGTH                     0x00000001

