MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB410/mcu.h
#define _ANSF_ANSELF0_POSITION                   0x00000000
#define _ANSF_ANSELF0_MASK                       0x00000001
#define _ANSF_ANSELF0_LENGTH                     0x00000001

#define _ANSF_ANSELF1_POSITION                   0x00000001
#define _ANSF_ANSELF1_MASK                       0x00000002
#define _ANSF_ANSELF1_LENGTH                     0x00000001

#define _ANSF_ANSELF2_POSITION                   0x00000002
#define _ANSF_ANSELF2_MASK                       0x00000004
#define _ANSF_ANSELF2_LENGTH                     0x00000001

#define _ANSF_ANSELF3_POSITION                   0x00000003
#define _ANSF_ANSELF3_MASK                       0x00000008
#define _ANSF_ANSELF3_LENGTH                     0x00000001

#define _ANSF_ANSELF4_POSITION                   0x00000004
#define _ANSF_ANSELF4_MASK                       0x00000010
#define _ANSF_ANSELF4_LENGTH                     0x00000001

#define _ANSF_ANSELF5_POSITION                   0x00000005
#define _ANSF_ANSELF5_MASK                       0x00000020
#define _ANSF_ANSELF5_LENGTH                     0x00000001

#define _ANSF_ANSELF8_POSITION                   0x00000008
#define _ANSF_ANSELF8_MASK                       0x00000100
#define _ANSF_ANSELF8_LENGTH                     0x00000001

#define _ANSF_ANSELF12_POSITION                  0x0000000C
#define _ANSF_ANSELF12_MASK                      0x00001000
#define _ANSF_ANSELF12_LENGTH                    0x00000001

#define _ANSF_ANSELF13_POSITION                  0x0000000D
#define _ANSF_ANSELF13_MASK                      0x00002000
#define _ANSF_ANSELF13_LENGTH                    0x00000001

#define _IOCPF_IOCPF0_POSITION                   0x00000000
#define _IOCPF_IOCPF0_MASK                       0x00000001
#define _IOCPF_IOCPF0_LENGTH                     0x00000001

#define _IOCPF_IOCPF1_POSITION                   0x00000001
#define _IOCPF_IOCPF1_MASK                       0x00000002
#define _IOCPF_IOCPF1_LENGTH                     0x00000001

#define _IOCPF_IOCPF2_POSITION                   0x00000002
#define _IOCPF_IOCPF2_MASK                       0x00000004
#define _IOCPF_IOCPF2_LENGTH                     0x00000001

#define _IOCPF_IOCPF3_POSITION                   0x00000003
#define _IOCPF_IOCPF3_MASK                       0x00000008
#define _IOCPF_IOCPF3_LENGTH                     0x00000001

#define _IOCPF_IOCPF4_POSITION                   0x00000004
#define _IOCPF_IOCPF4_MASK                       0x00000010
#define _IOCPF_IOCPF4_LENGTH                     0x00000001

#define _IOCPF_IOCPF5_POSITION                   0x00000005
#define _IOCPF_IOCPF5_MASK                       0x00000020
#define _IOCPF_IOCPF5_LENGTH                     0x00000001

#define _IOCPF_IOCPF6_POSITION                   0x00000006
#define _IOCPF_IOCPF6_MASK                       0x00000040
#define _IOCPF_IOCPF6_LENGTH                     0x00000001

#define _IOCPF_IOCPF7_POSITION                   0x00000007
#define _IOCPF_IOCPF7_MASK                       0x00000080
#define _IOCPF_IOCPF7_LENGTH                     0x00000001

#define _IOCPF_IOCPF8_POSITION                   0x00000008
#define _IOCPF_IOCPF8_MASK                       0x00000100
#define _IOCPF_IOCPF8_LENGTH                     0x00000001

#define _IOCPF_IOCPF12_POSITION                  0x0000000C
#define _IOCPF_IOCPF12_MASK                      0x00001000
#define _IOCPF_IOCPF12_LENGTH                    0x00000001

#define _IOCPF_IOCPF13_POSITION                  0x0000000D
#define _IOCPF_IOCPF13_MASK                      0x00002000
#define _IOCPF_IOCPF13_LENGTH                    0x00000001

#define _IOCNF_IOCNF0_POSITION                   0x00000000
#define _IOCNF_IOCNF0_MASK                       0x00000001
#define _IOCNF_IOCNF0_LENGTH                     0x00000001

#define _IOCNF_IOCNF1_POSITION                   0x00000001
#define _IOCNF_IOCNF1_MASK                       0x00000002
#define _IOCNF_IOCNF1_LENGTH                     0x00000001

#define _IOCNF_IOCNF2_POSITION                   0x00000002
#define _IOCNF_IOCNF2_MASK                       0x00000004
#define _IOCNF_IOCNF2_LENGTH                     0x00000001

#define _IOCNF_IOCNF3_POSITION                   0x00000003
#define _IOCNF_IOCNF3_MASK                       0x00000008
#define _IOCNF_IOCNF3_LENGTH                     0x00000001

#define _IOCNF_IOCNF4_POSITION                   0x00000004
#define _IOCNF_IOCNF4_MASK                       0x00000010
#define _IOCNF_IOCNF4_LENGTH                     0x00000001

#define _IOCNF_IOCNF5_POSITION                   0x00000005
#define _IOCNF_IOCNF5_MASK                       0x00000020
#define _IOCNF_IOCNF5_LENGTH                     0x00000001

#define _IOCNF_IOCNF6_POSITION                   0x00000006
#define _IOCNF_IOCNF6_MASK                       0x00000040
#define _IOCNF_IOCNF6_LENGTH                     0x00000001

#define _IOCNF_IOCNF7_POSITION                   0x00000007
#define _IOCNF_IOCNF7_MASK                       0x00000080
#define _IOCNF_IOCNF7_LENGTH                     0x00000001

#define _IOCNF_IOCNF8_POSITION                   0x00000008
#define _IOCNF_IOCNF8_MASK                       0x00000100
#define _IOCNF_IOCNF8_LENGTH                     0x00000001

#define _IOCNF_IOCNF12_POSITION                  0x0000000C
#define _IOCNF_IOCNF12_MASK                      0x00001000
#define _IOCNF_IOCNF12_LENGTH                    0x00000001

#define _IOCNF_IOCNF13_POSITION                  0x0000000D
#define _IOCNF_IOCNF13_MASK                      0x00002000
#define _IOCNF_IOCNF13_LENGTH                    0x00000001

#define _IOCFF_IOCFF0_POSITION                   0x00000000
#define _IOCFF_IOCFF0_MASK                       0x00000001
#define _IOCFF_IOCFF0_LENGTH                     0x00000001

#define _IOCFF_IOCFF1_POSITION                   0x00000001
#define _IOCFF_IOCFF1_MASK                       0x00000002
#define _IOCFF_IOCFF1_LENGTH                     0x00000001

#define _IOCFF_IOCFF2_POSITION                   0x00000002
#define _IOCFF_IOCFF2_MASK                       0x00000004
#define _IOCFF_IOCFF2_LENGTH                     0x00000001

#define _IOCFF_IOCFF3_POSITION                   0x00000003
#define _IOCFF_IOCFF3_MASK                       0x00000008
#define _IOCFF_IOCFF3_LENGTH                     0x00000001

#define _IOCFF_IOCFF4_POSITION                   0x00000004
#define _IOCFF_IOCFF4_MASK                       0x00000010
#define _IOCFF_IOCFF4_LENGTH                     0x00000001

#define _IOCFF_IOCFF5_POSITION                   0x00000005
#define _IOCFF_IOCFF5_MASK                       0x00000020
#define _IOCFF_IOCFF5_LENGTH                     0x00000001

