MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB410/mcu.h
#define _IOCPDH_IOCPDH0_POSITION                 0x00000000
#define _IOCPDH_IOCPDH0_MASK                     0x00000001
#define _IOCPDH_IOCPDH0_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH1_POSITION                 0x00000001
#define _IOCPDH_IOCPDH1_MASK                     0x00000002
#define _IOCPDH_IOCPDH1_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH2_POSITION                 0x00000002
#define _IOCPDH_IOCPDH2_MASK                     0x00000004
#define _IOCPDH_IOCPDH2_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH3_POSITION                 0x00000003
#define _IOCPDH_IOCPDH3_MASK                     0x00000008
#define _IOCPDH_IOCPDH3_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH4_POSITION                 0x00000004
#define _IOCPDH_IOCPDH4_MASK                     0x00000010
#define _IOCPDH_IOCPDH4_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH5_POSITION                 0x00000005
#define _IOCPDH_IOCPDH5_MASK                     0x00000020
#define _IOCPDH_IOCPDH5_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH6_POSITION                 0x00000006
#define _IOCPDH_IOCPDH6_MASK                     0x00000040
#define _IOCPDH_IOCPDH6_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH7_POSITION                 0x00000007
#define _IOCPDH_IOCPDH7_MASK                     0x00000080
#define _IOCPDH_IOCPDH7_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH8_POSITION                 0x00000008
#define _IOCPDH_IOCPDH8_MASK                     0x00000100
#define _IOCPDH_IOCPDH8_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH9_POSITION                 0x00000009
#define _IOCPDH_IOCPDH9_MASK                     0x00000200
#define _IOCPDH_IOCPDH9_LENGTH                   0x00000001

#define _IOCPDH_IOCPDH10_POSITION                0x0000000A
#define _IOCPDH_IOCPDH10_MASK                    0x00000400
#define _IOCPDH_IOCPDH10_LENGTH                  0x00000001

#define _IOCPDH_IOCPDH11_POSITION                0x0000000B
#define _IOCPDH_IOCPDH11_MASK                    0x00000800
#define _IOCPDH_IOCPDH11_LENGTH                  0x00000001

#define _IOCPDH_IOCPDH12_POSITION                0x0000000C
#define _IOCPDH_IOCPDH12_MASK                    0x00001000
#define _IOCPDH_IOCPDH12_LENGTH                  0x00000001

#define _IOCPDH_IOCPDH13_POSITION                0x0000000D
#define _IOCPDH_IOCPDH13_MASK                    0x00002000
#define _IOCPDH_IOCPDH13_LENGTH                  0x00000001

#define _IOCPDH_IOCPDH14_POSITION                0x0000000E
#define _IOCPDH_IOCPDH14_MASK                    0x00004000
#define _IOCPDH_IOCPDH14_LENGTH                  0x00000001

#define _IOCPDH_IOCPDH15_POSITION                0x0000000F
#define _IOCPDH_IOCPDH15_MASK                    0x00008000
#define _IOCPDH_IOCPDH15_LENGTH                  0x00000001

#define _IOCPDH_CNPDH0_POSITION                  0x00000000
#define _IOCPDH_CNPDH0_MASK                      0x00000001
#define _IOCPDH_CNPDH0_LENGTH                    0x00000001

#define _IOCPDH_CNPDH1_POSITION                  0x00000001
#define _IOCPDH_CNPDH1_MASK                      0x00000002
#define _IOCPDH_CNPDH1_LENGTH                    0x00000001

#define _IOCPDH_CNPDH2_POSITION                  0x00000002
#define _IOCPDH_CNPDH2_MASK                      0x00000004
#define _IOCPDH_CNPDH2_LENGTH                    0x00000001

#define _IOCPDH_CNPDH3_POSITION                  0x00000003
#define _IOCPDH_CNPDH3_MASK                      0x00000008
#define _IOCPDH_CNPDH3_LENGTH                    0x00000001

#define _IOCPDH_CNPDH4_POSITION                  0x00000004
#define _IOCPDH_CNPDH4_MASK                      0x00000010
#define _IOCPDH_CNPDH4_LENGTH                    0x00000001

#define _IOCPDH_CNPDH5_POSITION                  0x00000005
#define _IOCPDH_CNPDH5_MASK                      0x00000020
#define _IOCPDH_CNPDH5_LENGTH                    0x00000001

#define _IOCPDH_CNPDH6_POSITION                  0x00000006
#define _IOCPDH_CNPDH6_MASK                      0x00000040
#define _IOCPDH_CNPDH6_LENGTH                    0x00000001

#define _IOCPDH_CNPDH7_POSITION                  0x00000007
#define _IOCPDH_CNPDH7_MASK                      0x00000080
#define _IOCPDH_CNPDH7_LENGTH                    0x00000001

#define _IOCPDH_CNPDH8_POSITION                  0x00000008
#define _IOCPDH_CNPDH8_MASK                      0x00000100
#define _IOCPDH_CNPDH8_LENGTH                    0x00000001

#define _IOCPDH_CNPDH9_POSITION                  0x00000009
#define _IOCPDH_CNPDH9_MASK                      0x00000200
#define _IOCPDH_CNPDH9_LENGTH                    0x00000001

#define _IOCPDH_CNPDH10_POSITION                 0x0000000A
#define _IOCPDH_CNPDH10_MASK                     0x00000400
#define _IOCPDH_CNPDH10_LENGTH                   0x00000001

#define _IOCPDH_CNPDH11_POSITION                 0x0000000B
#define _IOCPDH_CNPDH11_MASK                     0x00000800
#define _IOCPDH_CNPDH11_LENGTH                   0x00000001

#define _IOCPDH_CNPDH12_POSITION                 0x0000000C
#define _IOCPDH_CNPDH12_MASK                     0x00001000
#define _IOCPDH_CNPDH12_LENGTH                   0x00000001

#define _IOCPDH_CNPDH13_POSITION                 0x0000000D
#define _IOCPDH_CNPDH13_MASK                     0x00002000
#define _IOCPDH_CNPDH13_LENGTH                   0x00000001

#define _IOCPDH_CNPDH14_POSITION                 0x0000000E
#define _IOCPDH_CNPDH14_MASK                     0x00004000
#define _IOCPDH_CNPDH14_LENGTH                   0x00000001

#define _IOCPDH_CNPDH15_POSITION                 0x0000000F
#define _IOCPDH_CNPDH15_MASK                     0x00008000
#define _IOCPDH_CNPDH15_LENGTH                   0x00000001

#define _TRISJ_TRISJ0_POSITION                   0x00000000
#define _TRISJ_TRISJ0_MASK                       0x00000001
#define _TRISJ_TRISJ0_LENGTH                     0x00000001

#define _TRISJ_TRISJ1_POSITION                   0x00000001
#define _TRISJ_TRISJ1_MASK                       0x00000002
#define _TRISJ_TRISJ1_LENGTH                     0x00000001

#define _PORTJ_RJ0_POSITION                      0x00000000
#define _PORTJ_RJ0_MASK                          0x00000001
#define _PORTJ_RJ0_LENGTH                        0x00000001

#define _PORTJ_RJ1_POSITION                      0x00000001
#define _PORTJ_RJ1_MASK                          0x00000002
#define _PORTJ_RJ1_LENGTH                        0x00000001

#define _LATJ_LATJ0_POSITION                     0x00000000
#define _LATJ_LATJ0_MASK                         0x00000001
#define _LATJ_LATJ0_LENGTH                       0x00000001

#define _LATJ_LATJ1_POSITION                     0x00000001
#define _LATJ_LATJ1_MASK                         0x00000002
#define _LATJ_LATJ1_LENGTH                       0x00000001

#define _ODCJ_ODCJ0_POSITION                     0x00000000
#define _ODCJ_ODCJ0_MASK                         0x00000001
#define _ODCJ_ODCJ0_LENGTH                       0x00000001

